// 1.	Дан массив пользователей:
//     let users = [{ name: "Петя", age: 22 }, { name: "Вася", age: 31 }, { name: "Маша", age: 25 }, { name: "Ира", age: 15 }, { name: "Андрей", age:31}, { name: "Света", age:25}]
// Необходимо:
//     Добавить в него 2х новых пользователей с не пустым именем и возрастом.
//     Удалить из него всех пользователей с возрастом 22.
// Отсортировать массив по полю age в порядке возрастания, если возраст у нескольких пользователей одинаковый их отсортировать алфавитном порядке по name.
//     Добавить каждому пользователю поле salary типа number (значения присвоить любые).
// Написать функцию подсчета суммы зарплат всех пользователй.

let users = [
    { name: "Петя", age: 22 },
    { name: "Вася", age: 31 },
    { name: "Маша", age: 25 },
    { name: "Ира", age: 15 },
    { name: "Андрей", age:31},
    { name: "Света", age:25}
];
